#                                                Chap 1 :- Pandas
                
                
➡ Pandas Series(1D):- 
        1> Tuple()
        2> Dictionary{}

In [ ]:
#1> Tuple
import pandas as pd
a = (1,7,2,5)
s = pd.Series(a)
# s = pd.Series(a,index = ['x','y','z','w'])      # For Index from x,y,z,w
print(s)
print(s[0])
print(s[1])
print(s[2])

In [ ]:
#2> Dictionary
data = {"day1" : 420,"day2":390,"day3":330}
s = pd.Series(data)
print(s)

# ➡ Data Frame(2D) :- 
        1> by using dictionary
        2> by using CSV file

In [ ]:
# 1> by using dictionary
data = {"A":[1,2,4],"B":[5,6,8],"C":[9,7,5]}
df = pd.DataFrame(data)
df # OR ➡ print(df)

In [ ]:
df.loc[0:1]

In [ ]:
df[["B"]]

In [ ]:
df[["B","C"]]

In [ ]:
df[["B","C"]].loc[1:2]

In [ ]:
# 2> By using CSV File
import pandas as pd
df = pd.read_csv("auto-mpg.csv")
df

In [ ]:
df.info()    #for get Information of csv file

In [ ]:
df.head()  #default : First 5 line of csv file

In [ ]:
df.head(9)   #First 5 line of csv file

In [ ]:
df.tail()        #default : Last 5 line of csv file

In [ ]:
df.tail(7)    #First 7 line of csv file

In [ ]:
df[["model year","origin","car name"]].loc[101:110]

#                                                    DATA CLEANING

In [50]:
import numpy as np
import pandas as pd
data = {"name":["william","Emma","Sofia","Markus","Eward","Thomas","Ethan",np.nan,"Arun","Ankita","Paula"],"region":[np.nan,"north","east",np.nan,"west","west","south",np.nan,"west","east","south"],"sales":[50000,50000,np.nan,np.nan,42000,72000,49000,np.nan,67000,65000,67000],"expences":[42000,43000,np.nan,np.nan,38000,39000,42000,np.nan,39000,50000,45000]}
df = pd.DataFrame(data)
df

       name region    sales  expences
0   william    NaN  50000.0   42000.0
1      Emma  north  50000.0   43000.0
2     Sofia   east      NaN       NaN
3    Markus    NaN      NaN       NaN
4     Eward   west  42000.0   38000.0
5    Thomas   west  72000.0   39000.0
6     Ethan  south  49000.0   42000.0
7       NaN    NaN      NaN       NaN
8      Arun   west  67000.0   39000.0
9    Ankita   east  65000.0   50000.0
10    Paula  south  67000.0   45000.0

#                                                 # 1> DATA DROP

In [ ]:
df.isna().sum()  #isna() for check null data

In [ ]:
df.dropna(thresh = 2)       #dropna() dor remove null data, thresh = 2 means every column have atlist 2 valid data

In [ ]:
df.dropna()  # remove all row with any number of null

In [ ]:
# remove only if all values are null
df.dropna(how = "all")

In [53]:
# Drop only seles and expences are null 
df.dropna(subset = ["sales","expences"])

       name region    sales  expences
0   william    NaN  50000.0   42000.0
1      Emma  north  50000.0   43000.0
4     Eward   west  42000.0   38000.0
5    Thomas   west  72000.0   39000.0
6     Ethan  south  49000.0   42000.0
8      Arun   west  67000.0   39000.0
9    Ankita   east  65000.0   50000.0
10    Paula  south  67000.0   45000.0

In [ ]:
df.dropna(axis = 0)  #same as dropna() , axis = 0 means X axis

In [ ]:
df.dropna(axis = 1) #same as dropna() , axis = 1 means Y axis

In [ ]:
df["sales"]

# 2> FILL DATA

In [ ]:
df["sales"].fillna(0)  #replace all null value of Sales column with 0

In [ ]:
df["sales"].fillna(df["sales"].mean())  #replace all null value of Sales column with avg of sales column

In [ ]:
df["sales"].fillna(df["sales"].median())

In [59]:
df = pd.read_csv("auto-mpg.csv")
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [60]:
df.shape

(398, 9)

In [ ]:
df[df["horsepower"]=="?"]

In [ ]:
df[df["mpg"]>35]

#MIMP Progrem

Finding and Removing Outliers

In [85]:
#FIND outliers
# STEP 1
q1 = df["acceleration"].quantile(0.25)
q3 = df["acceleration"].quantile(0.75)
# STEP 2
iqr = q3-q1
# STEP 3
low = q1 - (1.5*iqr)
high = q3 + (1.5*iqr)
print("Q1 :- ",q1)
print("Q3 :- ",q3)
print("IQR :- ",iqr)
print("LOW :- ",low)
print("HIGH :- ",high)
# Finding outliers
outliers = df[(df["acceleration"]<low) | (df["acceleration"]>high)]
outliers

Q1 :-  13.825000000000001
Q3 :-  17.174999999999997
IQR :-  3.349999999999996
LOW :-  8.800000000000008
HIGH :-  22.199999999999992

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
7,14.0,8,440.0,215,4312,8.5,70,1,plymouth fury iii
9,15.0,8,390.0,190,3850,8.5,70,1,amc ambassador dpl
11,14.0,8,340.0,160,3609,8.0,70,1,plymouth 'cuda 340
59,23.0,4,97.0,54,2254,23.5,72,2,volkswagen type 3
195,29.0,4,85.0,52,2035,22.2,76,1,chevrolet chevette
299,27.2,4,141.0,71,3190,24.8,79,2,peugeot 504
300,23.9,8,260.0,90,3420,22.2,79,1,oldsmobile cutlass salon brougham
326,43.4,4,90.0,48,2335,23.7,80,2,vw dasher (diesel)
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup

In [88]:
#Remove outliers
# STEP 1
q1 = df["acceleration"].quantile(0.25)
q3 = df["acceleration"].quantile(0.75)
# STEP 2
iqr = q3-q1
# STEP 3
low = q1 - (1.5*iqr)
high = q3 + (1.5*iqr)
print("Q1 :- ",q1)
print("Q3 :- ",q3)
print("IQR :- ",iqr)
print("LOW :- ",low)
print("HIGH :- ",high)
# removing outliers
outliers = df[(df["acceleration"]>=low) & (df["acceleration"]<=high)]
outliers

Q1 :-  13.825000000000001
Q3 :-  17.174999999999997
IQR :-  3.349999999999996
LOW :-  8.800000000000008
HIGH :-  22.199999999999992

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
392,27.0,4,151.0,90,2950,17.3,82,1,chevrolet camaro
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [90]:
df = pd.read_csv("diabetes_unclean.csv")
# STEP 1
q1 = df["HbA1c"].quantile(0.25)
q3 = df["HbA1c"].quantile(0.75)
# STEP 2
iqr = q3-q1
# STEP 3
low = q1 - (1.5*iqr)
high = q3 + (1.5*iqr)
print("Q1 :- ",q1)
print("Q3 :- ",q3)
print("IQR :- ",iqr)
print("LOW :- ",low)
print("HIGH :- ",high)
# Finding outliers
outliers = df[(df["HbA1c"]<low) | (df["HbA1c"]>high)]
outliers

Q1 :-  6.5
Q3 :-  10.2
IQR :-  3.6999999999999993
LOW :-  0.9500000000000011
HIGH :-  15.749999999999998

,ID,No_Pation,Gender,AGE,Urea,Cr,HbA1c,Chol,TG,HDL,LDL,VLDL,BMI,CLASS
80,138,45399,F,57.0,4.6,97.0,0.9,3.2,1.3,0.9,3.0,1.1,22.0,N
92,161,45406,F,60.0,7.5,70.0,0.9,3.4,5.3,1.1,3.6,0.8,24.0,N
98,182,454316,M,60.0,7.5,70.0,0.9,3.4,5.3,1.1,3.6,0.8,24.0,N
101,197,454316,F,57.0,4.6,97.0,0.9,3.2,1.3,0.9,3.0,1.1,22.0,N
805,689,34554,M,55.0,5.1,39.0,15.9,4.2,1.2,1.4,3.0,2.0,38.0,Y
897,61,65456,F,61.0,8.1,72.0,16.0,7.7,3.1,1.6,4.9,1.4,26.0,Y

In [91]:
df = pd.read_csv("diabetes_unclean.csv")
# STEP 1
q1 = df["HbA1c"].quantile(0.25)
q3 = df["HbA1c"].quantile(0.75)
# STEP 2
iqr = q3-q1
# STEP 3
low = q1 - (1.5*iqr)
high = q3 + (1.5*iqr)
print("Q1 :- ",q1)
print("Q3 :- ",q3)
print("IQR :- ",iqr)
print("LOW :- ",low)
print("HIGH :- ",high)
# Finding outliers
outliers = df[(df["HbA1c"]>=low) & (df["HbA1c"]<=high)]
outliers

Q1 :-  6.5
Q3 :-  10.2
IQR :-  3.6999999999999993
LOW :-  0.9500000000000011
HIGH :-  15.749999999999998

,ID,No_Pation,Gender,AGE,Urea,Cr,HbA1c,Chol,TG,HDL,LDL,VLDL,BMI,CLASS
0,502,17975,F,50.0,4.7,46.0,4.9,4.2,0.9,2.4,1.4,0.5,24.0,N
1,735,34221,M,26.0,4.5,62.0,4.9,3.7,1.4,1.1,2.1,0.6,23.0,N
2,420,47975,F,50.0,4.7,46.0,4.9,4.2,0.9,2.4,1.4,0.5,24.0,N
3,680,87656,F,50.0,4.7,46.0,4.9,4.2,0.9,2.4,1.4,0.5,24.0,N
4,504,34223,M,33.0,7.1,46.0,4.9,4.9,1.0,0.8,2.0,0.4,21.0,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1003,189,454316,M,58.0,4.0,55.0,7.9,4.9,2.0,1.2,1.4,1.1,35.0,Y
1004,191,454316,M,55.0,NaN,62.0,6.8,5.3,2.0,1.0,3.5,0.9,30.1,Y
1006,193,454316,M,62.0,6.3,82.0,6.7,5.3,2.0,1.0,3.5,NaN,30.1,Y
1007,194,454316,F,57.0,4.1,70.0,9.3,5.3,3.3,1.0,1.4,1.3,29.0,Y
1008,195,4543,f,55.0,4.1,34.0,13.9,5.4,1.6,1.6,3.1,0.7,33.0,Y